package practice.sec09;

public class Practice1 {

	public static void main(String[] args) {
		/* 1. 데이터 베이스 정의 : 
		 * 여러 사람에 의해 공유되어 사용될 목적으로 통합하여 관리되는 데이터의 집합을 말한다.
		 * 줄여서 DB. 특정 다수의 이용자들에게 필요한 정보를 제공한다든지 
		 * 조직 내에서 필요로 하는 정보를 체계적으로 축적하여 
		 * 그 조직 내의 이용자에게 필요한 정보를 제공하는 정보 서비스 기관의 심장부에 해당된다.
		 * 
		 * 
		 * 2. 파일 시스템 정의 : 
		 * 파일 시스템은 컴퓨터에서 파일이나 자료를 쉽게 발견 및 접근할 수 있도록 보관 또는 조직하는 체제를 가리키는 말이다.
		 * 파일 시스템은 통상 하드 디스크나 CD-ROM 같은 실제 자료 보관 장치를 사용하여 
		 * 파일의 물리적 소재를 관리하는 것을 가리키나 
		 * 네트워크 프로토콜(NFS, SMB, 9P 등)을 수행하는 클라이언트를 통하여 
		 * 파일 서버 상의 자료로의 접근을 제공하는 방식과 
		 * 가상의 형태로서 접근 수단만이 존재하는 방식(procfs 등)도 파일 시스템의 범위에 포함될 수 있다.
		 * 
		 * 3. 서버 - 클라이언트 정의 :  
		 * 클라이언트는 서비스를 사용하는 사용자 혹은 사용자의 단말기를 가리키는 말이다. 
		 * 서버란 서비스를 제공하는 컴퓨터이며, 
		 * 다수의 클라이언트를 위해 존재하기 때문에 
		 * 일반적으로 매우 큰 용량과 성능을 가지고 있다.
		 *  
		 */
		
	}

}
