//1. 1bit : 메모리의 최소 저장 단위인 bit, 1bit가 증가할 때마다 저장 단위가 2배 늘어난다. bit가 8개 모이면 Byte라고 한다. 
//2. 1byte : 컴퓨터 내에서 정보를 처리하는 가장 작은 단위. 비트 8개로 이루어지며, 따라서 1 바이트는 2^8=256가지 범위의 데이터를 표현할 수 있다. 가장 대표적인 예가 1바이트로 1글자를 표현하는 아스키 코드.
//3. 1Mbyte : 메가바이트(megabyte, 약자 MB)는 106(1,000,000) 바이트, 또는 220(1,048,576) 바이트를 뜻하는 정보 혹은 저장 장치의 단위이다.
//4. 1Kbyte : 킬로바이트(kilobyte)는 1000바이트, 혹은 1024바이트를 뜻하는 정보의 단위이다. 1000을 나타내는 SI 접두어 킬로에서 왔다. 일반적으로 KB, kB, Kbyte, kbyte 등으로 표시한다.
//5. 1Gbyte : 기가바이트(gigabyte, 약칭 GB)는 1000³ 바이트 또는 1024³ 바이트에 해당하는 정보의 단위이다.
//6. 1Tbyte : 테라바이트(Terabyte, TB)는 1012를 의미하는 SI 접두어인 테라와 컴퓨터 데이터의 표시단위인 바이트가 합쳐진 자료량을 의미하는 단위이다. 이진 접두어를 사용한 테비바이트(TiB) 와 구분된다.
//
//1 TB = 1012 bytes = 1,000,000,000,000 bytes