//56

//변수 이름 지을 때 유의사항 6가지
//1. 변수 이름은 영문자, 숫자, 밑줄(_), 달러 기호($)로 구성된다(변수의 이름은 영어, 숫자, 특수문자는 밑줄과 달러기호만 허용한다.)
//2. 변수는 영문자로 시작해야 하며, 숫자로 시작할 수 없다. 숫자는 사용 가능하지만 변수명의 첫 글자로는 사용 불가
//3. 대소문자가 구분되며, 길이에 제한이 없다.
//4. 자바의 예약어(Reserved Words)는 식별자로 사용할 수 없다.(if, else, for, class 등)
//5. 여러 단어로 이루어진 변수는 단어의 첫 글자를 대문자로 표기하는 "카멜 표기법"을 사용하는 것이 관례이다. 권장사항(변수의 첫문자는 소문자로 하고 중간에 언더스코어를 사용하지 않는다.)
//6. 상수(변하지 않는 값)의 이름은 모두 대문자로 작성하며 여러 단어는 밑줄로 구분한다

//57
//=, +=, % 연산자에 대해서 설명해 주세요
//1. = : 특정한 상수 값이나 변수 값 또는 객체를 변수에 전달하여 기억시킬 때 사용하는 연산자인 대입연산자이며 연사자를 중심으로 오른쪽 변수값을 왼쪽 변수에 대입한다 
//2. += : 똑같이 대입연산자이며 왼쪽 변수에 더하면서 대입한다 풀어쓰면 변수 = 변수 + 변수1 과 같다
//3. % : 산술연산자이며 두 수를 나눈 후 그 나머지를 반환한다.

//58
//++전위, 후위 연산자에 대해서 설명해 주세요
//++ : 증감연산자이며 피연산자의 값을 1씩 증가 또는 감소시키는 연산자이다. 증감연산자가 변수 앞에 위치하느냐 변수 뒤에 위치하느냐에 따라 결과 값이 달라진다
//x++ : 해당 연산을 먼저 수행한 후 피연산자의 값을 1증가 시킴
//++x : 먼저 피연산자의 값을 1증가 시킨 후 해당 연산을 수행함



