//1. 프로그램 정의 : 프로그램이란 컴퓨터가 특정 작업이나 일련의 작업을 수행하도록 작성된 명령어들의 집합이다. 컴퓨터는 이 프로그램을 통해 주어진 명령을 순차적으로 실행하여 작업을 처리한다. 예를 들어, 우리가 사용하는 워드 프로세서, 웹 브라우저, 게임, 운영 체제 등은 모두 프로그램에 해당된다.
//2. 프로그램 실행의 의미 : 여러 프로그램 언어로 쓰인 프로그램을 기계어로 번역하여 프로그램을 주기억 장치 내로 배정하고 그 처리 시작 주소에서 연속 명령을 실행하는 것. 프로그램 실행을 위해서는 명령의 인출, 주소 연산, 피연산자의 해석, 명령 부호의 실행 등 여러 가지 중앙 처리 장치 동작이 실행된다.
//3. 컴퓨터 프로그램 정의 : 컴퓨터 프로그램은 컴퓨터가 특정 작업을 수행하기 위해 따르는 일련의 지침이다. 이러한 프로그램은 Java와 같은 프로그래밍 언어로 작성되며 계산기 앱과 같은 간단한 것부터 운영 체제처럼 복잡한 것까지 다양하다.
//4. 프로그램 언어 정의 : 프로그래밍 언어는 컴퓨터에게 명령이나 연산을 시킬 수 있도록 설계된 언어로 컴퓨터와 의사소통할 수 있게 해준다. 컴퓨터 시스템을 구동시키는 소프트웨어를 작성하기 위해 사용한다.
//5. 소프트웨어 정의 :  컴퓨터를 구성하는 요소로서 하드웨어에 대응하는 용어로 사용하고, 컴퓨터 이외에도 특정한 목적을 위한 장치에서 기능을 수행하는 논리적 절차와 규칙, 관련 체계를 통칭한다.
//6. 코드 : 프로그래밍 언어를 사용한 명령들을 모아 놓은 집합이다. 프로그래밍 언어를 글자, 코드는 문장이라고 할 수 있다.
//7. 코딩 : 코드를 입력해 컴퓨터를 작동할 수 있게 하는 과정이다.
//8. 프로그래머 : 컴퓨터 프로그램의 논리나 알고리즘을 설계하고 프로그램을 작성하고 테스트하는 사람. 프로그래머는 소프트웨어 엔지니어, 컴퓨터과학자, 해커로 간주되기도 한다.
//9. 하드웨어 :  컴퓨터 하드웨어는 컴퓨터 시스템이 작동하는 데 필요한 물리적 구성 요소이다. 그래픽 카드, 중앙처리장치(CPU), 환기용 팬, 전원 공급 장치 등을 포함한다.
//10. 고급언어, 저급 언어 정의 : 프로그램을 만들기 위해서 사용하는 언어는 컴퓨터가 이해하는 언어가 아닌 사람이 이해하기 쉽게 만들어진 언어이다. 사람이 이해하기 쉽게 만들어진 언어를 고급 언어라고 한다. 반대로 컴퓨터가 직접 이해하고 실행할 수 있는 언어를 저급 언어라고 한다.
//11. 컴파일러 정의 : 프로그래밍 언어로 작성된 소스 코드를 컴퓨터가 이해할 수 있는 기계어로 변환하는 소프트웨어 도구이다.
//12. 버그 : 소프트웨어가 예상하지 못한 잘못된 결과를 내거나, 오류가 발생하거나, 착오나 오작동이 발생하는 등의 문제를 뜻한다. 버그는 프로그램의 소스 코드나 설계 과정에서의 결점, 결함 및 오류 때문에 발생한다.
//13. 디버그 디버깅 : 디버그는 프로그래밍 과정중에 발생하는 오류나 비정상적인 연산, 즉 버그를 찾고 수정하는 것이다. 이 과정을 디버깅이라 하기도 한다.

